AirGlycerin/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (glycerin air);

glycerin
{
    transportModel  Newtonian;
    nu              6.3417731565997301373124851178665e-4; // Vel Cinematica!
    rho             1259.9;
}

air
{
    transportModel  Newtonian;
    nu              1.46e-05; // Vel Cinematica!
    rho             1.225;
}

sigma            0.068;


// ************************************************************************* //
