AirGlycerin/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//

vertices
(
    (0 0 0)     // Vértice 0
    (0.1 0 0)    // Vértice 1
    (0.1 0.02 0)    // Vértice 2
    (0 0.02 0)     // Vértice 3
    (0 0 0.001)     // Vértice 4
    (0.1 0 0.001)    // Vértice 5
    (0.1 0.02 0.001)    // Vértice 6
    (0 0.02 0.001)     // Vértice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (250 25 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
//*************************************************************************//
